/*
Да се напише функција која како аргументи од главната програма добива низа од цели
броеви и должина на низата. Низата и должината се внесуваат во главната програма.
Функцијата треба да ја преврти низата (првиот елемент да постане последен, вториот
претпоследен итн.). Потребно е да се реализираат двата случаеви:
a) Функцијата како резултат ја враќ а новата низа и во главната програма се печати новата
низа;
b) Новата низа се печати во самата функција.
За изминување и трансформирање на низата мора да се користат покажувачи.
*/
#include <stdio.h>
void transformacija(int *niza, int n){
    int i, pom;
    for(i =0; i<n/2; i++){
        pom = 0; 
        pom = *(niza+i);
        *(niza+i) = *(niza+n-1-i);
        *(niza+n-1-i) = pom;
    }

}
int main(){
    int niza[100], n , i;
    printf("Vnesi ja dolzinata > ", &n);
    scanf("%d", &n);
    printf("Pocni so vnesuvanje na nizata > \n");
    for(i=0; i<n; i++){
        scanf("%d", &niza[i]);
    }
    transformacija(&niza, n);
    printf("Nova niza \n");
    for(i=0; i<n;i++){
        printf("%d ", *(niza+i));

    }
    return 0;
}